IDENTIFICATION DIVISION.
PROGRAM-ID. TSTPERFM.
PROCEDURE DIVISION.
A-PARA.
   PERFORM DISPLAY 'A-PARA'
   END-PERFORM.
   PERFORM C-PARA THRU E-PARA.

B-PARA.
   DISPLAY 'B-PARA'.
   STOP RUN.

C-PARA.
    DISPLAY 'C-PARA'.

D-PARA.
    DISPLAY 'D-PARA'.

E-PARA.
    DISPLAY 'E-PARA'.

Output:

A-PARA
C-PARA
D-PARA
E-PARA
B-PARA