IDENTIFICATION DIVISION. 
PROGRAM-ID. hello.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION .
01 premierevariable Pic 9 Value ZERO.
PROCEDURE DIVISION.
       DISPLAY "Hello , word" .
       DISPLAY "valeur :" premierevariable.
       MOVE 2 TO premierevariable.
STOP RUN.


       
       DISPLAY "mon premiere paragraph".
       DISPLAY "valeur :"premierevariable.
        
